test/vcr_cassettes/customer_vault/authorize_capture.yml

---
http_interactions:
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?address1=456%20Oak%20Ave&ccexp=1025&ccnumber=<CREDIT_CARD>&city=Los%20Angeles&country=US&currency=USD&customer_vault=add_customer&cvv=<CVV>&email=jane@example.com&first_name=Jane&last_name=Smith&payment=creditcard&phone=555-555-1234&security_key=<NMI_SECURITY_KEY>&state=CA&test_mode=enabled&zip=90001
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 20 Nov 2025 23:30:42 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '238'
      X-Volterra-Location:
      - b-dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Customer Added&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=&response_code=100&customer_vault_id=1712313551
  recorded_at: Thu, 20 Nov 2025 23:30:42 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?amount=25.0&currency=USD&customer_vault_id=1712313551&payment=creditcard&security_key=<NMI_SECURITY_KEY>&test_mode=enabled&type=auth
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 20 Nov 2025 23:30:42 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '1126'
      X-Volterra-Location:
      - dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=SUCCESS&authcode=123456&transactionid=11386676025&avsresponse=N&cvvresponse=&orderid=&type=auth&response_code=100&customer_vault_id=1712313551
  recorded_at: Thu, 20 Nov 2025 23:30:43 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?amount=25.0&currency=USD&payment=creditcard&security_key=<NMI_SECURITY_KEY>&test_mode=enabled&transactionid=11386676025&type=capture
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 20 Nov 2025 23:30:44 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '1049'
      X-Volterra-Location:
      - b-dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=SUCCESS&authcode=123456&transactionid=11386676025&avsresponse=&cvvresponse=&orderid=&type=capture&response_code=100
  recorded_at: Thu, 20 Nov 2025 23:30:45 GMT
- request:
    method: get
    uri: https://figpay.transactiongateway.com/api/transact.php?currency=USD&customer_vault=delete_customer&customer_vault_id=1712313551&payment=creditcard&security_key=<NMI_SECURITY_KEY>&test_mode=enabled
    body:
      encoding: US-ASCII
      string: ''
    headers:
      Content-Type:
      - application/xml
      Accept:
      - application/xml
      Accept-Encoding:
      - gzip;q=1.0,deflate;q=0.6,identity;q=0.3
      User-Agent:
      - Ruby
  response:
    status:
      code: 200
      message: OK
    headers:
      Date:
      - Thu, 20 Nov 2025 23:30:45 GMT
      Vary:
      - X-Unique-Id
      Content-Type:
      - text/html; charset=UTF-8
      X-Envoy-Upstream-Service-Time:
      - '258'
      X-Volterra-Location:
      - b-dal3-dal
      Server:
      - volt-adc
      Transfer-Encoding:
      - chunked
    body:
      encoding: UTF-8
      string: response=1&responsetext=Customer Deleted&authcode=&transactionid=&avsresponse=&cvvresponse=&orderid=&type=&response_code=100
  recorded_at: Thu, 20 Nov 2025 23:30:45 GMT
recorded_with: VCR 6.3.1
